

def p1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    print(countries_dict["Германия"])
    for key in sorted(countries_dict):
        print(key, " - ", countries_dict[key])
def p2():
    alp = {"авеинорст": 1, "дклмпу": 2, "бгёья": 3, "йы": 4, "жзхцч": 5, "шэю": 8, "фщъ": 10}
    w = input("слово   ")
    b = 0
    for i in w:
         for x in alp:
             if i in x:
                 b += alp[x.lower()]
    print("сумма",b)
def p3():
    a = {"первый студент": "немецкий, русский", "второй студент": "японский, англиский, бельгийский",
         "третий студент": "англиский, китайский", "четвертый студент": "англиский, китайский, баварский"}
    z1 = []
    t = []
    for i in a:
        c = a[i.lower()].split(", ")
        for x in c:
            z1.append(x)
            if x == "китайский":
                t.append(i)
    z = sorted(set(z1))
    print(z)
    print(t)


p2()
